Public Attributes | List of all members
API_AnalyticalNode Struct Reference
Element Manager API
Describes an Structural Analytical Node. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
UInt32  | nodeId
Unique identifier of the Structural Analytical Node.
API_Coord3D  | coord
The 3D coordinate of the Structural Analytical Node.
Detailed Description
Describes an Structural Analytical Node.
Since
Archicad 25
Member Data Documentation
◆ coord
 API_AnalyticalNode::coord
The 3D coordinate of the Structural Analytical Node.
◆ nodeId
 API_AnalyticalNode::nodeId
Unique identifier of the Structural Analytical Node.